// Задача 24: Напишите программу, которая принимает на вход число (А) и выдаёт сумму чисел от 1 до А.
// 7 -> 28
// 4 -> 10
// 8 -> 36
//----------------------------------------------------------------------------------------------------------------------------
// void SumNumbers(int n)
// {
//     int summ = 0;
//     for (int i = 1; i <= n; i++){
//         summ += i;
//     }
//     Console.WriteLine($"{n} -> {summ}");
// }
// Console.Write("Введите число: ");
// int A = Convert.ToInt32(Console.ReadLine());
// SumNumbers(A);
//============================================================================================================================
// Задача 26: Напишите программу, которая принимает на вход число и выдаёт количество цифр в числе.
// 456 -> 3
// 78 -> 2
// 89126 -> 5
//----------------------------------------------------------------------------------------------------------------------------
// int CountDigits(int num)
// {
//     int count = 0;
//     while (num > 9){
//         num = num / 10;
//         count += 1;
//     }
//     count += 1;
//     return count;
// }
// Console.Write("Введите число: ");
// int number = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine($"{number} -> {CountDigits(number)}");
//============================================================================================================================
// Задача 28: Напишите программу, которая принимает на вход число N и выдаёт произведение чисел от 1 до N.
// 4 -> 24
// 5 -> 120
//----------------------------------------------------------------------------------------------------------------------------
// void MultGigits(int m)
// {
//     int resultMult = 1;
//     for (int i = 1; i <= m; i++){
//         resultMult = resultMult * i;
//     }
//     Console.WriteLine($"{m} -> {resultMult}");
// }
// Console.Write("Введите число: ");
// int N = Convert.ToInt32(Console.ReadLine());
// MultGigits(N);
//============================================================================================================================
// Задача 30: Напишите программу, которая выводит массив из 8 элементов, заполненный нулями и единицами в случайном порядке.
// [1,0,1,1,0,1,0,0]
//----------------------------------------------------------------------------------------------------------------------------
int[] CreateArray(int lenght)
{
    int[] arr = new int[lenght];
    for (int i = 0; i < lenght; i++){
        arr[i] = new Random().Next(2);
        Console.Write($"{arr[i]} ");
    }
    return arr;
}
int[] nums = CreateArray(8);


